RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_sdio.c
/**
 **************************************************************************
 * File Name    : at32f4xx_sdio.c
 * Description  : at32f4xx SDIO source file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_sdio.h"
#include "at32f4xx_rcc.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup SDIO
  * @brief SDIO driver modules
  * @{
  */

/** @defgroup SDIO_Private_TypesDefinitions
  * @{
  */

/* --- CLKCR Register ---*/

/* SDIO CLKEN mask */
#define CLKCTRL_CLKEN_Set           ((uint32_t)0x00000100)
#define CLKCTRL_CLKEN_Rst           ((uint32_t)0xFFFFFEFF)


/* --- CMD Register ---*/

/* SDIO SDIOSUSPEND mask */
#define CMD_SDIOSUSP_Set            ((uint32_t)0x00000800)
#define CMD_SDIOSUSP_Rst            ((uint32_t)0xFFFFF7FF)

/* SDIO ENCMDCOMPL mask */
#define CMD_CMPLSGNLEN_Set          ((uint32_t)0x00001000)
#define CMD_CMPLSGNLEN_Rst          ((uint32_t)0xFFFFEFFF)

/* SDIO INTDIS mask */
#define CMD_INTDIS_Set              ((uint32_t)0x00002000)
#define CMD_INTDIS_Rst              ((uint32_t)0xFFFFDFFF)

/* SDIO ATACMD mask */
#define CMD_ATACMD_Set              ((uint32_t)0x00004000)
#define CMD_ATACMD_Rst              ((uint32_t)0xFFFFBFFF)


/* --- DTCTRL Register ---*/

/* SDIO ATACMD mask */
#define DTCTRL_DMAEN_Set            ((uint32_t)0x00000008)
#define DTCTRL_DMAEN_Rst            ((uint32_t)0xFFFFFFF7)

/* SDIO RWSTART mask */
#define DTCTRL_RWSTART_Set          ((uint32_t)0x00000100)
#define DTCTRL_RWSTART_Rst          ((uint32_t)0xFFFFFEFF)

/* SDIO RWSTOP mask */
#define DTCTRL_RWSTOP_Set           ((uint32_t)0x00000200)
#define DTCTRL_RWSTOP_Rst           ((uint32_t)0xFFFFFDFF)

/* SDIO RWMOD mask */
#define DTCTRL_RWMOD_Set            ((uint32_t)0x00000400)

/* SDIO SDIOEN mask */
#define DTCTRL_SDIOEN_Set           ((uint32_t)0x00000800)
#define DTCTRL_SDIOEN_Rst           ((uint32_t)0xFFFFF7FF)

/* ---------------------- SDIO registers bit mask ------------------------ */

/* --- CLKCR Register ---*/

/* CLKCR register clear mask */
#define CLKCTRL_CLEAR_MASK          ((uint32_t)0xFFFE0100)

/* --- PWRCTRL Register ---*/

/* SDIO PWRCTRL Mask */
#define PWR_PWRCTRL_MASK            ((uint32_t)0xFFFFFFFC)

/* --- DTCTRL Register ---*/

/* SDIO DTCTRL Clear Mask */
#define DTCTRL_CLEAR_MASK           ((uint32_t)0xFFFFFF08)
#define DTCTRL_RWMOD_MASK           ((uint32_t)0xFFFFFBFF)

/* --- CMD Register ---*/

/* CMD Register clear mask */
#define CMD_CLEAR_MASK              ((uint32_t)0xFFFFF800)

/* SDIO RESP Registers Address Offset */
#define SDIO_RSP_ADDR_OFFSET        ((uint32_t)0x14)

/**
  * @}
  */

/** @defgroup SDIO_Private_Defines
  * @{
  */

/**
  * @}
  */

/** @defgroup SDIO_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup SDIO_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup SDIO_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup SDIO_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the SDIO peripheral registers to their default reset values.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @retval None
  */
void SDIO_Reset(SDIO_Type * SDIOx)
{
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  SDIOx->POWER = 0x00000000;
  SDIOx->CLKCTRL = 0x00000000;
  SDIOx->ARG = 0x00000000;
  SDIOx->CMD = 0x00000000;
  SDIOx->DTTMR = 0x00000000;
  SDIOx->DTLEN = 0x00000000;
  SDIOx->DTCTRL = 0x00000000;
  SDIOx->INTCLR = 0x00C007FF;
  SDIOx->INTEN = 0x00000000;
}

/**
  * @brief  Initializes the SDIO peripheral according to the specified
  *         parameters in the SDIO_InitStruct.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_InitStruct : pointer to a SDIO_InitType structure
  *         that contains the configuration information for the SDIO peripheral.
  * @retval None
  */
void SDIO_Init(SDIO_Type * SDIOx, SDIO_InitType* SDIO_InitStruct)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_CLK_EDGE(SDIO_InitStruct->SDIO_ClkEdge));
  assert_param(IS_SDIO_CLK_BYPASS(SDIO_InitStruct->SDIO_ClkBypass));
  assert_param(IS_SDIO_CLK_POWER_SAVE(SDIO_InitStruct->SDIO_ClkPowerSave));
  assert_param(IS_SDIO_BUS_WIDTH(SDIO_InitStruct->SDIO_BusWidth));
  assert_param(IS_SDIO_FLOW_CTRL(SDIO_InitStruct->SDIO_FlowCtrl));

  /*---------------------------- SDIO CLKCR Configuration ------------------------*/
  /* Get the SDIOx CLKCR value */
  tmpreg = SDIOx->CLKCTRL;

  /* Clear CLKDIV, PWRSAV, BYPASS, WIDBUS, NEGEDGE, HWFC_EN bits */
  tmpreg &= CLKCTRL_CLEAR_MASK;

  /* Set PWRSAV bit according to SDIO_ClockPowerSave value */
  /* Set BYPASS bit according to SDIO_ClockBypass value */
  /* Set WIDBUS bits according to SDIO_BusWide value */
  /* Set NEGEDGE bits according to SDIO_ClockEdge value */
  /* Set HWFC_EN bits according to SDIO_HardwareFlowControl value */
  tmpreg |= (SDIO_InitStruct->SDIO_ClkPowerSave | SDIO_InitStruct->SDIO_ClkBypass |
             SDIO_InitStruct->SDIO_BusWidth | SDIO_InitStruct->SDIO_ClkEdge | SDIO_InitStruct->SDIO_FlowCtrl);

  /* Set CLKDIV bits according to SDIO_ClockDiv value */
  tmpreg |= ((SDIO_InitStruct->SDIO_ClkPsc & 0x00FF) | ((SDIO_InitStruct->SDIO_ClkPsc & 0x0300) << 7));
  /* Write to SDIOx CLKCR */
  SDIOx->CLKCTRL = tmpreg;
}

/**
  * @brief  Fills each SDIO_InitStruct member with its default value.
  * @param  SDIO_InitStruct: pointer to an SDIO_InitType structure which
  *   will be initialized.
  * @retval None
  */
void SDIO_StructInit(SDIO_InitType* SDIO_InitStruct)
{
  /* SDIO_InitStruct members default value */
  SDIO_InitStruct->SDIO_ClkPsc = 0x00;
  SDIO_InitStruct->SDIO_ClkEdge = SDIO_ClkEdge_Rising;
  SDIO_InitStruct->SDIO_ClkBypass = SDIO_ClkBypass_Disable;
  SDIO_InitStruct->SDIO_ClkPowerSave = SDIO_ClkPowerSave_Disable;
  SDIO_InitStruct->SDIO_BusWidth = SDIO_BusWidth_1b;
  SDIO_InitStruct->SDIO_FlowCtrl = SDIO_FlowCtrl_Disable;
}

/**
  * @brief  Enables or disables the SDIO Clock.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of the SDIO Clock. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_ClockCmd(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the SDIO Clock. */
    SDIOx->CLKCTRL |= CLKCTRL_CLKEN_Set;
  }
  else
  {
    /* Disable the SDIO Clock. */
    SDIOx->CLKCTRL &= CLKCTRL_CLKEN_Rst;
  }
}

/**
  * @brief  Sets the power status of the controller.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_PowerState: new state of the Power state.
  *   This parameter can be one of the following values:
  *     @arg SDIO_PowerSave_OFF
  *     @arg SDIO_PowerSave_ON
  * @retval None
  */
void SDIO_SetPowerSaveState(SDIO_Type * SDIOx, uint32_t SDIO_PowerState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_POWER_SAVE(SDIO_PowerState));

