RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_sdio.c
  SDIOx->POWER &= PWR_PWRCTRL_MASK;
  SDIOx->POWER |= SDIO_PowerState;
}

/**
  * @brief  Gets the power status of the controller.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @retval Power status of the controller. The returned value can
  *   be one of the following:
  * - 0x00: Power OFF
  * - 0x02: Power UP
  * - 0x03: Power ON
  */
uint32_t SDIO_GetPowerSaveState(SDIO_Type * SDIOx)
{
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  return (SDIOx->POWER & (~PWR_PWRCTRL_MASK));
}

/**
  * @brief  Enables or disables the SDIO interrupts.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_INT: specifies the SDIO interrupt sources to be enabled or disabled.
  *   This parameter can be one or a combination of the following values:
  *     @arg SDIO_INT_CMDFAIL:    Command response received (CRC check failed) interrupt
  *     @arg SDIO_INT_DTFAIL:     Data block sent/received (CRC check failed) interrupt
  *     @arg SDIO_INT_CMDTIMEOUT: Command response timeout interrupt
  *     @arg SDIO_INT_DTTIMEOUT:  Data timeout interrupt
  *     @arg SDIO_INT_TXERRU:     Transmit FIFO underrun error interrupt
  *     @arg SDIO_INT_RXERRO:     Received FIFO overrun error interrupt
  *     @arg SDIO_INT_CMDRSPCMPL: Command response received (CRC check passed) interrupt
  *     @arg SDIO_INT_CMDCMPL:    Command sent (no response required) interrupt
  *     @arg SDIO_INT_DTCMPL:     Data end (data counter, SDIDCOUNT, is zero) interrupt
  *     @arg SDIO_INT_SBITERR:    Start bit not detected on all data signals in wide bus mode interrupt
  *     @arg SDIO_INT_DTBLKCMPL:  Data block sent/received (CRC check passed) interrupt
  *     @arg SDIO_INT_DOCMD:      Command transfer in progress interrupt
  *     @arg SDIO_INT_DOTX:       Data transmit in progress interrupt
  *     @arg SDIO_INT_DORX:       Data receive in progress interrupt
  *     @arg SDIO_INT_TXBUF_H:    Transmit FIFO Half Empty interrupt
  *     @arg SDIO_INT_RXBUF_H:    Receive FIFO Half Full interrupt
  *     @arg SDIO_INT_TXBUF_F:    Transmit FIFO full interrupt
  *     @arg SDIO_INT_RXBUF_F:    Receive FIFO full interrupt
  *     @arg SDIO_INT_TXBUF_E:    Transmit FIFO empty interrupt
  *     @arg SDIO_INT_RXBUF_E:    Receive FIFO empty interrupt
  *     @arg SDIO_INT_TXBUF:      Data available in transmit FIFO interrupt
  *     @arg SDIO_INT_RXBUF:      Data available in receive FIFO interrupt
  *     @arg SDIO_INT_SDIOIF:     SD I/O interrupt received interrupt
  *     @arg SDIO_INT_ATACMPL:    CE-ATA command completion signal received for CMD61 interrupt
  * @param  NewState: new state of the specified SDIO interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_INTConfig(SDIO_Type * SDIOx, uint32_t SDIO_INT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_INT(SDIO_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the SDIO interrupts */
    SDIOx->INTEN |= SDIO_INT;
  }
  else
  {
    /* Disable the SDIO interrupts */
    SDIOx->INTEN &= ~SDIO_INT;
  }
}

/**
  * @brief  Enables or disables the SDIO DMA request.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of the selected SDIO DMA request.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_DMACmd(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected SDIO DMA request. */
    SDIOx->DTCTRL |= DTCTRL_DMAEN_Set;
  }
  else
  {
    /* Disable the selected SDIO DMA request. */
    SDIOx->DTCTRL &= DTCTRL_DMAEN_Rst;
  }
}

/**
  * @brief  Initializes the SDIO Command according to the specified
  *         parameters in the SDIO_CmdInitStruct and send the command.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_CmdInitStruct : pointer to a SDIO_CmdInitType
  *         structure that contains the configuration information for the SDIO command.
  * @retval None
  */
void SDIO_SendCommand(SDIO_Type * SDIOx, SDIO_CmdInitType *SDIO_CmdInitStruct)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_CMD_IDX(SDIO_CmdInitStruct->SDIO_CmdIdx));
  assert_param(IS_SDIO_RSP_TYPE(SDIO_CmdInitStruct->SDIO_Resp));
  assert_param(IS_SDIO_WAIT(SDIO_CmdInitStruct->SDIO_Wait));
  assert_param(IS_SDIO_CPSM(SDIO_CmdInitStruct->SDIO_CPSM));

  /*---------------------------- SDIOx ARG Configuration ------------------------*/
  /* Set the SDIOx Argument value */
  SDIOx->ARG = SDIO_CmdInitStruct->SDIO_Argu;

  /*---------------------------- SDIOx CMD Configuration ------------------------*/
  /* Get the SDIOx CMD value */
  tmpreg = SDIOx->CMD;
  /* Clear CMDINDEX, WAITRESP, WAITINT, WAITPEND, CPSMEN bits */
  tmpreg &= CMD_CLEAR_MASK;
  /* Set CMDINDEX bits according to SDIO_CmdIndex value */
  /* Set WAITRESP bits according to SDIO_Response value */
  /* Set WAITINT and WAITPEND bits according to SDIO_Wait value */
  /* Set CPSMEN bits according to SDIO_CPSM value */
  tmpreg |= (uint32_t)SDIO_CmdInitStruct->SDIO_CmdIdx | SDIO_CmdInitStruct->SDIO_Resp
            | SDIO_CmdInitStruct->SDIO_Wait | SDIO_CmdInitStruct->SDIO_CPSM;

  /* Write to SDIOx CMD */
  SDIOx->CMD = tmpreg;
}

/**
  * @brief  Fills each SDIO_CmdInitStruct member with its default value.
  * @param  SDIO_CmdInitStruct: pointer to an SDIO_CmdInitType
  *         structure which will be initialized.
  * @retval None
  */
void SDIO_CmdStructInit(SDIO_CmdInitType* SDIO_CmdInitStruct)
{
  /* SDIO_CmdInitStruct members default value */
  SDIO_CmdInitStruct->SDIO_Argu = 0x00;
  SDIO_CmdInitStruct->SDIO_CmdIdx = 0x00;
  SDIO_CmdInitStruct->SDIO_Resp = SDIO_Rsp_No;
  SDIO_CmdInitStruct->SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStruct->SDIO_CPSM = SDIO_CPSM_Disable;
}

/**
  * @brief  Returns command index of last command for which response received.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @retval Returns the command index of the last command response received.
  */
uint8_t SDIO_GetCommandResponse(SDIO_Type * SDIOx)
{
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  return (uint8_t)(SDIOx->RSPCMD);
}

/**
  * @brief  Returns response received from the card for the last command.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_RESP: Specifies the SDIO response register.
  *   This parameter can be one of the following values:
  *     @arg SDIO_RSP1: Response Register 1
  *     @arg SDIO_RSP2: Response Register 2
  *     @arg SDIO_RSP3: Response Register 3
  *     @arg SDIO_RSP4: Response Register 4
  * @retval The Corresponding response register value.
  */
uint32_t SDIO_GetResponse(SDIO_Type * SDIOx, uint32_t SDIO_RESP)
{
  __IO uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_RSP(SDIO_RESP));

  tmp = (uint32_t)&SDIOx->RSP1 + SDIO_RESP;

  return (*(__IO uint32_t *) tmp);
}

/**
  * @brief  Initializes the SDIO data path according to the specified
  *   parameters in the SDIO_DataInitStruct.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_DataInitStruct : pointer to a SDIO_DataInitType structure that
  *   contains the configuration information for the SDIO command.
  * @retval None
  */
void SDIO_DataConfig(SDIO_Type * SDIOx, SDIO_DataInitType* SDIO_DataInitStruct)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_DATA_LEN(SDIO_DataInitStruct->SDIO_DataLen));
  assert_param(IS_SDIO_BLK_SIZE(SDIO_DataInitStruct->SDIO_DataBlkSize));
  assert_param(IS_SDIO_TRANSFER_DIR(SDIO_DataInitStruct->SDIO_TransferDir));
  assert_param(IS_SDIO_TRANSFER_MODE(SDIO_DataInitStruct->SDIO_TransferMode));
  assert_param(IS_SDIO_DPSM(SDIO_DataInitStruct->SDIO_DPSM));

  /*---------------------------- SDIO DTIMER Configuration ---------------------*/
  /* Set the SDIOx Data TimeOut value */
  SDIOx->DTTMR = SDIO_DataInitStruct->SDIO_DataTimeOut;

