RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_sdio.c
  /*---------------------------- SDIOx DLEN Configuration -----------------------*/
  /* Set the SDIOx DataLength value */
  SDIOx->DTLEN = SDIO_DataInitStruct->SDIO_DataLen;

  /*---------------------------- SDIO DTCTRL Configuration ----------------------*/
  /* Get the SDIOx DTCTRL value */
  tmpreg = SDIOx->DTCTRL;
  /* Clear DEN, DTMODE, DTDIR and DBCKSIZE bits */
  tmpreg &= DTCTRL_CLEAR_MASK;
  /* Set DEN bit according to SDIO_DPSM value */
  /* Set DTMODE bit according to SDIO_TransferMode value */
  /* Set DTDIR bit according to SDIO_TransferDir value */
  /* Set DBCKSIZE bits according to SDIO_DataBlockSize value */
  tmpreg |= (uint32_t)SDIO_DataInitStruct->SDIO_DataBlkSize | SDIO_DataInitStruct->SDIO_TransferDir
            | SDIO_DataInitStruct->SDIO_TransferMode | SDIO_DataInitStruct->SDIO_DPSM;

  /* Write to SDIOx DTCTRL */
  SDIOx->DTCTRL = tmpreg;
}

/**
  * @brief  Fills each SDIO_DataInitStruct member with its default value.
  * @param  SDIO_DataInitStruct: pointer to an SDIO_DataInitType structure which
  *         will be initialized.
  * @retval None
  */
void SDIO_DataStructInit(SDIO_DataInitType* SDIO_DataInitStruct)
{
  /* SDIO_DataInitStruct members default value */
  SDIO_DataInitStruct->SDIO_DataTimeOut = 0xFFFFFFFF;
  SDIO_DataInitStruct->SDIO_DataLen = 0x00;
  SDIO_DataInitStruct->SDIO_DataBlkSize = SDIO_DataBlkSize_1b;
  SDIO_DataInitStruct->SDIO_TransferDir = SDIO_TransferDir_ToCard;
  SDIO_DataInitStruct->SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStruct->SDIO_DPSM = SDIO_DPSM_Disable;
}

/**
  * @brief  Returns number of remaining data bytes to be transferred.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @retval Number of remaining data bytes to be transferred
  */
uint32_t SDIO_GetDataCounter(SDIO_Type * SDIOx)
{
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  return SDIOx->DTCNTR;
}

/**
  * @brief  Read one data word from Rx FIFO.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @retval Data received
  */
uint32_t SDIO_ReadData(SDIO_Type * SDIOx)
{
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  return SDIOx->BUF;
}

/**
  * @brief  Write one data word to Tx FIFO.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  Data: 32-bit data word to write.
  * @retval None
  */
void SDIO_WriteData(SDIO_Type * SDIOx, uint32_t Data)
{
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  SDIOx->BUF = Data;
}

/**
  * @brief  Returns the number of words left to be written to or read from FIFO.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @retval Remaining number of words.
  */
uint32_t SDIO_GetBUFCount(SDIO_Type * SDIOx)
{
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  return SDIOx->BUFCNTR;
}

/**
  * @brief  Starts the SD I/O Read Wait operation.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of the Start SDIO Read Wait operation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_StartSDIOReadWait(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the Start SDIO Read Wait operation. */
    SDIOx->DTCTRL |= DTCTRL_RWSTART_Set;
  }
  else
  {
    /* Disable the Start SDIO Read Wait operation. */
    SDIOx->DTCTRL &= DTCTRL_RWSTART_Rst;
  }
}

/**
  * @brief  Stops the SD I/O Read Wait operation.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of the Stop SDIO Read Wait operation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_StopSDIOReadWait(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the Stop SDIO Read Wait operation. */
    SDIOx->DTCTRL |= DTCTRL_RWSTOP_Set;
  }
  else
  {
    /* Disable the Stop SDIO Read Wait operation. */
    SDIOx->DTCTRL &= DTCTRL_RWSTOP_Rst;
  }
}

/**
  * @brief  Sets one of the two options of inserting read wait interval.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_ReadWaitMode: SD I/O Read Wait operation mode.
  *   This parameter can be:
  *     @arg SDIO_ReadWaitMode_CLK: Read Wait control by stopping SDIOCLK
  *     @arg SDIO_ReadWaitMode_DATA2: Read Wait control using SDIO_DATA2
  * @retval None
  */
void SDIO_SetSDIOReadWaitMode(SDIO_Type * SDIOx, uint32_t SDIO_ReadWaitMode)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_READWAIT_MODE(SDIO_ReadWaitMode));

  SDIOx->DTCTRL &= DTCTRL_RWMOD_MASK;

  SDIOx->DTCTRL |= SDIO_ReadWaitMode;
}

/**
  * @brief  Enables or disables the SD I/O Mode Operation.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of SDIO specific operation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_SetSDIOOperation(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable SDIO specific operation. */
    SDIOx->DTCTRL |= DTCTRL_SDIOEN_Set;
  }
  else
  {
    /* Disable SDIO specific operation. */
    SDIOx->DTCTRL &= DTCTRL_SDIOEN_Rst;
  }
}

/**
  * @brief  Enables or disables the SD I/O Mode suspend command sending.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of the SD I/O Mode suspend command.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_SendSDIOSuspendCmd(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable SD I/O Mode suspend command. */
    SDIOx->CMD |= CMD_SDIOSUSP_Set;
  }
  else
  {
    /* Disable SD I/O Mode suspend command. */
    SDIOx->CMD &= CMD_SDIOSUSP_Rst;
  }
}

/**
  * @brief  Enables or disables the command completion signal.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of command completion signal.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_CommandCompletionCmd(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the command completion signal. */
    SDIOx->CMD |= CMD_CMPLSGNLEN_Set;
  }
  else
  {
    /* Disable the command completion signal. */
    SDIOx->CMD &= CMD_CMPLSGNLEN_Rst;
  }
}

/**
  * @brief  Enables or disables the CE-ATA interrupt.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of CE-ATA interrupt. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_ATAINTCmd(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable ATA Interrupt. */
    SDIOx->CMD &= CMD_INTDIS_Rst;
  }
  else
  {
    /* Disable CE-ATA command. */
    SDIOx->CMD |= CMD_INTDIS_Set;
  }
}

/**
  * @brief  Sends CE-ATA command (CMD61).
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  NewState: new state of CE-ATA command. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_SendATACmd(SDIO_Type * SDIOx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable CE-ATA command. */
    SDIOx->CMD |= CMD_ATACMD_Set;
  }
  else
  {
    /* Disable CE-ATA command. */
    SDIOx->CMD &= CMD_ATACMD_Rst;
  }
}

/**
  * @brief  Checks whether the specified SDIO flag is set or not.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg SDIO_FLG_CMDFAIL:    Command response received (CRC check failed)
  *     @arg SDIO_FLG_DTFAIL:     Data block sent/received (CRC check failed)
  *     @arg SDIO_FLG_CMDTIMEOUT: Command response timeout
  *     @arg SDIO_FLG_DTTIMEOUT:  Data timeout
  *     @arg SDIO_FLG_TXERRU:     Transmit FIFO underrun error
  *     @arg SDIO_FLG_RXERRO:     Received FIFO overrun error
  *     @arg SDIO_FLG_CMDRSPCMPL: Command response received (CRC check passed)
  *     @arg SDIO_FLG_CMDCMPL:    Command sent (no response required)
  *     @arg SDIO_FLG_DTCMPL:     Data end (data counter, SDIDCOUNT, is zero)
  *     @arg SDIO_FLG_SBITERR:    Start bit not detected on all data signals in wide bus mode.
  *     @arg SDIO_FLG_DTBLKCMPL:  Data block sent/received (CRC check passed)
  *     @arg SDIO_FLG_DOCMD:      Command transfer in progress
  *     @arg SDIO_FLG_DOTX:       Data transmit in progress
  *     @arg SDIO_FLG_DORX:       Data receive in progress
  *     @arg SDIO_FLG_TXBUF_H:    Transmit FIFO Half Empty
  *     @arg SDIO_FLG_RXBUF_H:    Receive FIFO Half Full
  *     @arg SDIO_FLG_TXBUF_F:    Transmit FIFO full
  *     @arg SDIO_FLG_RXBUF_F:    Receive FIFO full
  *     @arg SDIO_FLG_TXBUF_E:    Transmit FIFO empty
  *     @arg SDIO_FLG_RXBUF_E:    Receive FIFO empty
  *     @arg SDIO_FLG_TXBUF:      Data available in transmit FIFO
  *     @arg SDIO_FLG_RXBUF:      Data available in receive FIFO
  *     @arg SDIO_FLG_SDIOIF:     SD I/O interrupt received
  *     @arg SDIO_FLG_ATACMPL:    CE-ATA command completion signal received for CMD61
  * @retval The new state of SDIO_FLAG (SET or RESET).
  */
FlagStatus SDIO_GetFlagStatus(SDIO_Type * SDIOx, uint32_t SDIO_FLAG)
{
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_FLG(SDIO_FLAG));

  if ((SDIOx->STS & SDIO_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

