RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_sdio.c
  return bitstatus;
}

/**
  * @brief  Clears the SDIO's pending flags.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_FLAG: specifies the flag to clear.
  *   This parameter can be one or a combination of the following values:
  *     @arg SDIO_FLG_CMDFAIL:    Command response received (CRC check failed)
  *     @arg SDIO_FLG_DTFAIL:     Data block sent/received (CRC check failed)
  *     @arg SDIO_FLG_CMDTIMEOUT: Command response timeout
  *     @arg SDIO_FLG_DTTIMEOUT:  Data timeout
  *     @arg SDIO_FLG_TXERRU:     Transmit FIFO underrun error
  *     @arg SDIO_FLG_RXERRO:     Received FIFO overrun error
  *     @arg SDIO_FLG_CMDRSPCMPL: Command response received (CRC check passed)
  *     @arg SDIO_FLG_CMDCMPL:    Command sent (no response required)
  *     @arg SDIO_FLG_DTCMPL:     Data end (data counter, SDIDCOUNT, is zero)
  *     @arg SDIO_FLG_SBITERR:    Start bit not detected on all data signals in wide bus mode
  *     @arg SDIO_FLG_DTBLKCMPL:  Data block sent/received (CRC check passed)
  *     @arg SDIO_FLG_SDIOIF:     SD I/O interrupt received
  *     @arg SDIO_FLG_ATACMPL:    CE-ATA command completion signal received for CMD61
  * @retval None
  */
void SDIO_ClearFlag(SDIO_Type * SDIOx, uint32_t SDIO_FLAG)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_CLEAR_FLG(SDIO_FLAG));

  SDIOx->INTCLR = SDIO_FLAG;
}

/**
  * @brief  Checks whether the specified SDIO interrupt has occurred or not.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_INT: specifies the SDIO interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg SDIO_INT_CMDFAIL:    Command response received (CRC check failed) interrupt
  *     @arg SDIO_INT_DTFAIL:     Data block sent/received (CRC check failed) interrupt
  *     @arg SDIO_INT_CMDTIMEOUT: Command response timeout interrupt
  *     @arg SDIO_INT_DTTIMEOUT:  Data timeout interrupt
  *     @arg SDIO_INT_TXERRU:     Transmit FIFO underrun error interrupt
  *     @arg SDIO_INT_RXERRO:     Received FIFO overrun error interrupt
  *     @arg SDIO_INT_CMDRSPCMPL: Command response received (CRC check passed) interrupt
  *     @arg SDIO_INT_CMDCMPL:    Command sent (no response required) interrupt
  *     @arg SDIO_INT_DTCMPL:     Data end (data counter, SDIDCOUNT, is zero) interrupt
  *     @arg SDIO_INT_SBITERR:    Start bit not detected on all data signals in wide bus mode interrupt
  *     @arg SDIO_INT_DTBLKCMPL:  Data block sent/received (CRC check passed) interrupt
  *     @arg SDIO_INT_DOCMD:      Command transfer in progress interrupt
  *     @arg SDIO_INT_DOTX:       Data transmit in progress interrupt
  *     @arg SDIO_INT_DORX:       Data receive in progress interrupt
  *     @arg SDIO_INT_TXBUF_H:    Transmit FIFO Half Empty interrupt
  *     @arg SDIO_INT_RXBUF_H:    Receive FIFO Half Full interrupt
  *     @arg SDIO_INT_TXBUF_F:    Transmit FIFO full interrupt
  *     @arg SDIO_INT_RXBUF_F:    Receive FIFO full interrupt
  *     @arg SDIO_INT_TXBUF_E:    Transmit FIFO empty interrupt
  *     @arg SDIO_INT_RXBUF_E:    Receive FIFO empty interrupt
  *     @arg SDIO_INT_TXBUF:      Data available in transmit FIFO interrupt
  *     @arg SDIO_INT_RXBUF:      Data available in receive FIFO interrupt
  *     @arg SDIO_INT_SDIOIF:     SD I/O interrupt received interrupt
  *     @arg SDIO_INT_ATACMPL:    CE-ATA command completion signal received for CMD61 interrupt
  * @retval The new state of SDIO_INT (SET or RESET).
  */
ITStatus SDIO_GetINTStatus(SDIO_Type * SDIOx, uint32_t SDIO_INT)
{
  ITStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_GET_INT(SDIO_INT));

  if ((SDIOx->STS & SDIO_INT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/**
  * @brief  Clears the SDIO's interrupt pending bits.
  * @param  SDIOx: where x can be 1 or 2 to select the SDIO peripheral.
  * @param  SDIO_INT: specifies the interrupt pending bit to clear.
  *   This parameter can be one or a combination of the following values:
  *     @arg SDIO_INT_CMDFAIL:    Command response received (CRC check failed) interrupt
  *     @arg SDIO_INT_DTFAIL:     Data block sent/received (CRC check failed) interrupt
  *     @arg SDIO_INT_CMDTIMEOUT: Command response timeout interrupt
  *     @arg SDIO_INT_DTTIMEOUT:  Data timeout interrupt
  *     @arg SDIO_INT_TXERRU:     Transmit FIFO underrun error interrupt
  *     @arg SDIO_INT_RXERRO:     Received FIFO overrun error interrupt
  *     @arg SDIO_INT_CMDRSPCMPL: Command response received (CRC check passed) interrupt
  *     @arg SDIO_INT_CMDCMPL:    Command sent (no response required) interrupt
  *     @arg SDIO_INT_DTCMPL:     Data end (data counter, SDIDCOUNT, is zero) interrupt
  *     @arg SDIO_INT_SBITERR:    Start bit not detected on all data signals in wide bus mode interrupt
  *     @arg SDIO_INT_SDIOIF:     SD I/O interrupt received interrupt
  *     @arg SDIO_INT_ATACMPL:    CE-ATA command completion signal received for CMD61
  * @retval None
  */
void SDIO_ClearINTPendingBit(SDIO_Type * SDIOx, uint32_t SDIO_INT)
{
  /* Check the parameters */
  assert_param(IS_SDIO_ALL_PERIPH(SDIOx));
  assert_param(IS_SDIO_CLEAR_INT(SDIO_INT));

  SDIOx->INTCLR = SDIO_INT;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


